Benchmarking results/abbench_app1_eraldi_test3.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.11.12.16 (be patient)


Server Software:        Apache/2.4.10
Server Hostname:        10.11.12.16
Server Port:            80

Document Path:          /apps/app1/
Document Length:        5820 bytes

Concurrency Level:      100
Time taken for tests:   85.273 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      6371000 bytes
HTML transferred:       5820000 bytes
Requests per second:    11.73 [#/sec] (mean)
Time per request:       8527.274 [ms] (mean)
Time per request:       85.273 [ms] (mean, across all concurrent requests)
Transfer rate:          72.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    8  19.5      1      92
Processing:  2222 8216 1903.6   8286   14557
Waiting:     1465 7521 1636.0   7684   14499
Total:       2222 8223 1906.5   8288   14649

Percentage of the requests served within a certain time (ms)
  50%   8288
  66%   8980
  75%   9483
  80%   9708
  90%  10583
  95%  11278
  98%  11761
  99%  12831
 100%  14649 (longest request)