Benchmarking results/abbench_app1_test1.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.11.12.16 (be patient)


Server Software:        Apache/2.4.10
Server Hostname:        10.11.12.16
Server Port:            80

Document Path:          /apps/app1/
Document Length:        5820 bytes

Concurrency Level:      100
Time taken for tests:   427.330 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      6339000 bytes
HTML transferred:       5820000 bytes
Requests per second:    2.34 [#/sec] (mean)
Time per request:       42732.971 [ms] (mean)
Time per request:       427.330 [ms] (mean, across all concurrent requests)
Transfer rate:          14.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    9  24.6      0      90
Processing: 21375 42052 5216.5  42343   74572
Waiting:    21352 41665 5165.3  41932   74427
Total:      21375 42061 5223.0  42343   74649

Percentage of the requests served within a certain time (ms)
  50%  42343
  66%  43850
  75%  44492
  80%  45134
  90%  46621
  95%  47859
  98%  50911
  99%  63872
 100%  74649 (longest request)