Benchmarking results/abbench_app2_eraldi_test1.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.11.12.16 (be patient)


Server Software:        Apache/2.4.10
Server Hostname:        10.11.12.16
Server Port:            80

Document Path:          /apps/app2/
Document Length:        10377 bytes

Concurrency Level:      100
Time taken for tests:   308.209 seconds
Complete requests:      1000
Failed requests:        22
   (Connect: 0, Receive: 0, Length: 22, Exceptions: 0)
Non-2xx responses:      22
Total transferred:      10422440 bytes
HTML transferred:       10159222 bytes
Requests per second:    3.24 [#/sec] (mean)
Time per request:       30820.898 [ms] (mean)
Time per request:       308.209 [ms] (mean, across all concurrent requests)
Transfer rate:          33.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   9.6      0      35
Processing:   249 29254 6431.2  31279   32878
Waiting:      249 29248 6430.0  31277   32877
Total:        250 29257 6425.3  31279   32913

Percentage of the requests served within a certain time (ms)
  50%  31279
  66%  31413
  75%  31499
  80%  31549
  90%  31634
  95%  31701
  98%  31763
  99%  31790
 100%  32913 (longest request)