Benchmarking results/abbench_app2_eraldi_test2.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.11.12.16 (be patient)


Server Software:        Apache/2.4.10
Server Hostname:        10.11.12.16
Server Port:            80

Document Path:          /apps/app2/
Document Length:        10377 bytes

Concurrency Level:      100
Time taken for tests:   306.701 seconds
Complete requests:      1000
Failed requests:        25
   (Connect: 0, Receive: 0, Length: 25, Exceptions: 0)
Non-2xx responses:      25
Total transferred:      10392500 bytes
HTML transferred:       10129525 bytes
Requests per second:    3.26 [#/sec] (mean)
Time per request:       30670.126 [ms] (mean)
Time per request:       306.701 [ms] (mean, across all concurrent requests)
Transfer rate:          33.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  11.9      0      45
Processing:   284 29116 7003.5  31343   33951
Waiting:      283 29114 7003.5  31342   33949
Total:        284 29120 6996.9  31344   33952

Percentage of the requests served within a certain time (ms)
  50%  31344
  66%  31430
  75%  31492
  80%  31536
  90%  31638
  95%  31707
  98%  31810
  99%  32690
 100%  33952 (longest request)